QUEST/week9-10/todo_app/app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", nil], ["created_at", "2023-06-10 14:28:58.234934"], ["updated_at", "2023-06-10 14:28:58.234934"]]
---
  def create
    @todos = Todo.new(todo_params)
    @todos.save

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "1"], ["updated_at", "2023-06-11 14:22:43.709118"], ["id", 1]]
---
  def update
    @todo = Todo.find(params[:id])
    @todo.update(title: todo_params[:title])